app/views/main/_my_team_content.html.erb

                    <%= raw(show_date_of_the_game @my_team_next_game) %>
                    <tr class='clickable-row a-onlain' data-href='<%= match_path((@my_team_next_game.homeTeamName.split(' ').join('-')), (@my_team_next_game.date.strftime('%Y-%m-%d')), (@my_team_next_game.awayTeamName.split(' ').join('-'))) %>'>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."name" = ? LIMIT 1  [["name", "Liverpool FC"]]