app/views/shared/_sub_comments.html.erb

            <div class="media-body">
                <h4 class="media-heading name"><%= sub_comment.user.username if sub_comment.user.username %> <i><%= time_ago_in_words(sub_comment.created_at) %> назад</i></h4>
---
INSERT INTO "comments" ("body", "user_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "bdgfb"], ["user_id", 4], ["commentable_id", 123], ["commentable_type", "Comment"], ["created_at", "2016-12-10 07:36:55.974844"], ["updated_at", "2016-12-10 07:36:55.974844"]]