app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 88]]
SELECT  "articles".* FROM "articles" WHERE "articles"."category" = ? AND "articles"."league" = ? AND ("articles"."id" != 88)  ORDER BY created_at DESC LIMIT 15  [["category", "news"], ["league", "bundesliga"]]
---
  def show
    @article = Article.find(params[:id])
    @news = Article.order('created_at DESC').where(category: 'news', league: params[:league_id]).all_except(@article).first(15)