app/controllers/comments_controller.rb

    def create
      @comment = @commentable.comments.create(comment_params)
      @data = Article.find(params[:article_id]) if params[:article_id]
      @data = Video.find(params[:video_id]) if params[:video_id]
      @data = Onlain.find(params[:onlain_id]) if params[:onlain_id]
      if params[:comment_id]
        @com = Comment.find(params[:comment_id])
        @data = Article.find(@com.commentable_id) if @com.commentable_type == 'Article'
---
INSERT INTO "comments" ("body", "user_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "bdgfb"], ["user_id", 4], ["commentable_id", 123], ["commentable_type", "Comment"], ["created_at", "2016-12-10 07:36:55.974844"], ["updated_at", "2016-12-10 07:36:55.974844"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 88]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 123]]
SELECT "comments".* FROM "comments" WHERE "comments"."commentable_id" = ? AND "comments"."commentable_type" = ?  ORDER BY created_at DESC  [["commentable_id", 88], ["commentable_type", "Article"]]

    def upvote
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 172]]