app/controllers/leagues_controller.rb

  def show
    @news = Article.order('created_at DESC').where(category: 'news', league: params[:id]).first(20)
    @articles = Article.order('created_at DESC').where(category: 'article', league: params[:id]).first(2)
    @videos = Video.order('created_at DESC').where(league: params[:id]).first(5)
    @league = params[:id]
    if params[:id] == 'seria-a'
      @table_data = Table.where(league: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."category" = ? AND "articles"."league" = ?  ORDER BY created_at DESC LIMIT 20  [["category", "news"], ["league", "chempions-league"]]
SELECT  "videos".* FROM "videos" WHERE "videos"."league" = ?  ORDER BY created_at DESC LIMIT 5  [["league", "chempions-league"]]
SELECT  "tables".* FROM "tables" WHERE "tables"."league" = ?  ORDER BY "tables"."id" DESC LIMIT 1  [["league", "chempions-league"]]

  def fixtures
    @news = Article.order('created_at DESC').where(category: 'news').first(20)
    @fixtures = Match.order('date').where(['date > ? and league = ?', Time.current, params[:id]])
---
SELECT "matches".* FROM "matches" WHERE (date > '2016-12-10 07:40:16.682995' and league = 'apl')  ORDER BY date

  def results
    @news = Article.order('created_at DESC').where(category: 'news').first(20)
    @fixtures = Match.order('date DESC').where(['date < ? and league = ?', Time.current-2.hour, params[:id]])
---
SELECT "matches".* FROM "matches" WHERE (date < '2016-12-10 05:40:25.413927' and league = 'apl')  ORDER BY date DESC