app/controllers/main_controller.rb

SELECT  "videos".* FROM "videos"  ORDER BY created_at DESC LIMIT 5
---
    def index
        @main_news = Article.order('created_at DESC').where(category: 'news', main: true).first(4)
        @news = Article.order('created_at DESC').where(category: 'news').all_except(@main_news.map {|a| a.id}).first(20)
        @articles = Article.order('created_at DESC').where("category = 'article'").first(4)
        @videos = Video.order('created_at DESC').first(5)