app/controllers/main_controller.rb

SELECT  "articles".* FROM "articles" WHERE (category = 'news')  ORDER BY created_at DESC LIMIT 20
SELECT  "tables".* FROM "tables" WHERE "tables"."league" = ? LIMIT 1  [["league", "chempions-league"]]
---
    def index
        if  request.location && request.location.country == 'Ukraine'
            @main_news = Article.order('created_at DESC').where(category: 'news', main: true).where.not(league: 'russian').first(4)
            @news = Article.order('created_at DESC').where(category: 'news').where.not(league: 'russian').all_except(@main_news.map {|a| a.id}).first(20)
            @articles = Article.order('created_at DESC').where(category: 'article').where.not(league: 'russian').first(4)
            @videos = Video.order('created_at DESC').where(category: 'full').where.not(league: 'russian').first(5)
            @videos_short = Video.order('created_at DESC').where(category: 'overview').where.not(league: 'russian').first(6)
        elsif request.location &&  request.location.country == 'Russia'
            @main_news = Article.order('created_at DESC').where(category: 'news', main: true).where.not(league: 'ukraine').first(4)
            @news = Article.order('created_at DESC').where(category: 'news').where.not(league: 'ukraine').all_except(@main_news.map {|a| a.id}).first(20)
            @articles = Article.order('created_at DESC').where(category: 'article').where.not(league: 'ukraine').first(4)
            @videos = Video.order('created_at DESC').where(category: 'full').where.not(league: 'ukraine').first(5)
            @videos_short = Video.order('created_at DESC').where(category: 'overview').where.not(league: 'ukraine').first(6)
        else
            @main_news = Article.order('created_at DESC').where(category: 'news', main: true).first(4)
            @news = Article.order('created_at DESC').where(category: 'news').all_except(@main_news.map {|a| a.id}).first(20)
            @articles = Article.order('created_at DESC').where(category: 'article').first(4)
            @videos = Video.order('created_at DESC').where(category: 'full').first(5)
            @videos_short = Video.order('created_at DESC').where(category: 'overview').first(6)
        end
        @table_ge = Table.where(league: 'bundesliga').order(points: :desc)
        @table_it = Table.where(league: 'seria-a').order(points: :desc)
        @table_ua = Table.where(league: 'ukraine').order(points: :desc)
        @table_ru = Table.where(league: 'russian').order(points: :desc)
        @table_sp = Table.where(league: 'laliga').order(points: :desc)
        @table_en = Table.where(league: 'apl').order(points: :desc)
        @table_cl_a = Table.where(league: 'chempions-league', group: 'A')