app/controllers/news_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."category" = ?  ORDER BY created_at DESC LIMIT 7 OFFSET 0  [["category", "news"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category" = ?  [["category", "news"]]
---
                          description: "Следите за последними новостями Лиги Чемпионов - интересные истории, последние новости, видео основных моментов, результаты, слухи и интервью игроков.",
                          keywords: "спорт, футбол, УЕФА, Лига чемпионов, челси, Рим, бордо, Манчестер Юнайтед, Вильярреал, Анортосис, Интер, Вердером, Панатинаикос, Баварией, Фиорентина, Лион , steau Bucharest, барселона, шахтер донецк, спортивная лиссабон, базеле, арсенал, порто, динамо киев, мадрид, ливерпуль, Марсель, ПСВ, реальный, Ювентус, Зенит Санкт-Петербург,"
        elsif params[:league_id] == 'all'
            @articles = Article.paginate(page: params[:page], per_page: 7).order('created_at DESC').where(category: 'news')