app/controllers/teams_controller.rb

    def show
        @team = Team.find(params[:id])
        @league = @team.league
        @players = @team.players
        @teams = Team.all
        @news = Article.order('created_at DESC').where(team: @team.name, category: 'news').paginate(page: params[:page], per_page: 5)
        @articles = Article.order('created_at DESC').where(team: @team.name, category: 'articles').paginate(page: params[:page], per_page: 5)
        @videos = Video.order('created_at DESC').where('team_first = ? or team_second = ?', @team.name, @team.name).paginate(page: params[:page], per_page: 5)
        @table_data = Table.where(league: @team.league)
        @fixtures_prev = Match.order('date DESC').where("date BETWEEN ? AND ? and (\"homeTeamName\" = ? or \"awayTeamName\" = ?)", Time.zone.now-60.days, Time.current-2.hour, @team.name, @team.name).first(5)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 56]]
SELECT  "articles".* FROM "articles" WHERE "articles"."team" = ? AND "articles"."category" = ?  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["team", "Borussia Dortmund"], ["category", "news"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."team" = ? AND "articles"."category" = ?  [["team", "Manchester United FC"], ["category", "news"]]
SELECT  "videos".* FROM "videos" WHERE (team_first = 'Borussia Dortmund' or team_second = 'Borussia Dortmund')  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "videos" WHERE (team_first = 'Manchester United FC' or team_second = 'Manchester United FC')
SELECT  "tables".* FROM "tables" WHERE "tables"."league" = ?  ORDER BY "tables"."id" DESC LIMIT 1  [["league", "chempions-league"]]
SELECT "teams".* FROM "teams" WHERE "teams"."league" = ?  [["league", "chempions-league"]]
SELECT  "matches".* FROM "matches" WHERE (date BETWEEN '2016-10-11 08:24:37.025115' AND '2016-12-10 05:24:37.025463' and ("homeTeamName" = 'Borussia Dortmund' or "awayTeamName" = 'Borussia Dortmund'))  ORDER BY date DESC LIMIT 5